{
    "Overview List":
    [
        {
            "name": "Graduate Diploma in Systems Analysis", 
            "Next Intake": "August 2019 (Full-time)",
            "Duration": "Full-time 1 year",
            "Application Deadline": "15 April 2019 (For International Applications)\n30 April 2019 (For Local Applications)",
            "Download Brochure": "English: https://www.iss.nus.edu.sg/docs/default-source/3.0-graduate-programmes/gdipsa_brochure_combined.pdf?sfvrsn=2 , Chinese: https://www.iss.nus.edu.sg/docs/default-source/3.0-graduate-programmes/gdipsa_brochure_2018_ch.pdf?sfvrsn=2",
            "Info-session": "https://www.iss.nus.edu.sg/graduate-programmes/preview-talks-roadshows",
            "Overall Description": "The Graduate Diploma in Systems Analysis programme (GDipSA) is designed for non-IT graduates intending to craft a new career path in the IT industry. IT graduates and professionals who wish to advance their careers in their current field and recognise the need to equip themselves with the latest IT knowledge and skills to stay relevant may apply as well.\n\nThis is a full-time one-year programme. You can also explore the stackable pathway via the graduate degree programme for Digital Solutions Development. This is a series of four certificates which will stack up toward the Graduate Diploma of Systems Analysis. Go to: NUS-ISS Stackable Certificate Programmes in Digital Solutions Development: https://www.iss.nus.edu.sg/executive-education/course/detail/nus-iss-certificate-in-digital-solutions-development/. \n\nHaving graduated over 45 batches of students, many of our graduates are now prominent senior IT professionals, who have benefited from this programme. \n\nStudents who embark on this hands-on programme will be exposed to lectures, workshops, laboratory sessions, projects and a 5-month internship. We have designed numerous projects into the programme. The aim is to equip them with the necessary foundation to code, test, implement and troubleshoot IT solutions covering web and mobile platforms. \n\nBy the end of the programme, you will be equipped with sought-after technical skills and valuable soft skills.\n\nGraduates of this programme may choose to upgrade your skills after gaining a few years of work experience in the IT industry. You will be fully eligible to take up a Master degree with NUS and universities. Our Master of Technology programmes, offered in full-time and part-time formats, are designed for working IT professionals and managers who wish to advance their knowledge and skills. ",
            "Learning outcomes": "Technical:Gather user requirements\nSystematically analyse and design feasible IT solutions\nSelect the right technology\nCode, test and implement proposed solutions\nTrouble-shoot problems. Non-technical: Problem solving\nProject management\nTeamwork\nLeadership",
            "Recognition": ""
        },

        {
            "name": "Master of Technology in Enterprise Business Analytics",
            "Next Intake": "July 2019 (Full-time)",
            "Duration": "Full-time 1 year (2 semesters), Part-time 2 years (4 semesters)",
            "Application Deadline": "28 February 2019 (Full-time - Overseas applicants), 31 March 2019 (Full-time - Local applicants)",
            "Download Brochure": "https://www.iss.nus.edu.sg/docs/default-source/3.0-graduate-programmes/mtech_ebac_brochure_oct2018.pdf?sfvrsn=2",
            "Info-session": "https://www.iss.nus.edu.sg/graduate-programmes/preview-talks-roadshows",
            "Overall Description": "The NUS Master of Technology in Enterprise Business Analytics programme (MTech EBAC) is specifically designed to meet the industry demand for data scientists who can help organisations achieve improved business outcomes through data insights. It is best suited for professionals seeking to focus on the following - methodical data exploration and visualisation, diagnostic analytics, predictive modelling using statistical and machine learning techniques, text analytics, recommender systems, and big data engineering, etc.\n\nThe MTech EBAC programme prepares students for specialist, expert and leadership roles in enterprise business analytics to create business value through strategic use of data, analytics, models and frontline tools.\n\nBy contributing to more effective utilisation and management of data analytics, you can help your enterprise to focus on big decisions so that they gain better predictive ability that can translate to higher profits. Helping enterprises to build better and more effective models will lead to improved outcomes such as more attractive pricing, higher levels of customer care, better market segmentation, and highly-efficient inventory management and finally profit maximization.\nGraduates of the programme will be capable of undertaking tasks such as:\nDiscovering insights from data\nApplying concepts and techniques to solve major business problems\nDesigning and customizing marketing campaigns through efficient targeting\nAnalysing sales channels\nOptimising the marketing mix of their organisations\nImproving decision-making to increase returns on investments for their organisations\nPredicting the future profitability of their organisations\nAutomate production fault detection in manufacturing using predictive modelling",
            "Learning outcomes": "Help enterprises move towards a stronger emphasis on computer tools and statistical and machine learning techniques to develop high-performance analytics capability. Translate massive and complex unstructured data (e.g.: text) into insights. Produce predictive models to solve a broad range of problems across various business functions and units. Contribute to the development of more effective business strategies and plans for sustainable growth and competitive advantage",
            "Recognition": "Top student is awarded the IBM Medal and Book Prize\nBest Project Prize"
        },

        {
            "name": "Master of Technology in Digital Leadership",
            "Next Intake": "July 2019",
            "Duration": "Full-time 1 year (2 semesters)\nPart-time 2 years (4 semesters)",
            "Application Deadline": "28 February 2019 (Full-time applicants)\n30 April 2019 (Part-time applicants)",
            "Download Brochure": "https://www.iss.nus.edu.sg/docs/default-source/3.0-graduate-programmes/mtech_ebac_brochure_oct2018.pdf?sfvrsn=2",
            "Info-session": "https://www.iss.nus.edu.sg/graduate-programmes/preview-talks-roadshows, 1-on-1 session:Email to isslearn@nus.edu.sg for more details",
            "Overall Description": "In today’s world, almost every business is a digital business. In every industry, processes are being transformed by the pervasive use of digital technologies and rise of disruptive business models. To compete, businesses need to adapt and transform. Organisations need leaders who can think strategically to harness the digital change that create new opportunities for the business. This digital strategy and leadership programme prepares students to become leaders who can develop and lead strategies to transform their business to thrive in the new digital economy.\nIt is about the job of the digital leader and how the role has become increasingly complex and multi-faceted as the innovative use of technology permeates through the organisation and drives new business models. New demands are mandated on today's leaders to reap the full benefit of digital opportunities, manage risks, complexity and uncertainties, and to drive cultural changes. \n\nThis MTech DL programme that focus on digital strategy and leadership will equip students with the critical thinking, hard and soft skills to become an effective leader. It will accelerate their career and enhance one's ability to take on greater roles and responsibilities in digital leadership. Students will be equipped with the right processes and people capabilities to ride the digital wave and to thrive in the digital economy. Our goal is also to help organisations to develop its next generation of IT and digital leaders.",
            "Learning outcomes": "Understand the practice of digital business models\nDevelop leadership skills to lead the digital journey and drive breakthrough change for organisation\nCreate effective plans to bring about digital transformation in the business for competitive advantage\nEmbrace strategic thinking, innovation and effective communication",
            "Recognition": ""
        },

        {
            "name": "Master of Technology in Intelligent Systems", 
            "Next Intake": "July 2019 (Full-time)",
            "Duration": "Full-time 1 year (2 semesters), Part-time 2 years (4 semesters)",
            "Application Deadline": "28 February 2019 (Full-time - Overseas applicants), 31 March 2019 (Full-time - Local applicants)",
            "Download Brochure": "https://www.iss.nus.edu.sg/docs/default-source/3.0-graduate-programmes/mtech_is_brochure_oct2018.pdf?sfvrsn=2",
            "Info-session": "https://www.iss.nus.edu.sg/graduate-programmes/preview-talks-roadshows",
            "Overall Description": "The NUS Master of Technology in Intelligent Systems programme is targeted at working professionals who wish to be able to design and build systems that utilise Artificial Intelligence and other Smart Systems techniques. Application areas are wide and diverse, and include robotics, autonomous vehicles, intelligent sensing systems, Internet of Things, Smart City applications and Industry 4.0 applications, as well as applications within business and commerce.            The MTech IS programme emphasises the concepts, techniques and methods of Artificial Intelligence, and their application to the development of Intelligent Systems applications. The programme provides you with the essential knowledge and practical experience needed to become an Artificial Intelligence and Intelligent Systems specialist, and prepares you to be able to lead the development of Intelligent Systems in providing effective and optimal business solutions for your organisation.",
            "Learning outcomes": "Apply Intelligent Systems concepts, techniques and methods to solve varied problems across multiple domains including: business, manufacturing, engineering, heathcare etc.\nLead the development of Intelligent Systems using contemporary tools and techniques, including Artificial Intelligence, Machine Learning, Prediction, Forecasting, Classification, Clustering and Optimisation\nDesign and customise algorithms to solve complex business problems and create strategic advantage",
            "Recognition": "Top student is awarded the SPH Medal and Prize\nBest Project Prize"
        },

        {
            "name": "Master of Technology in Software Engineering",
            "Next Intake": "July 2019 (Full-time)",
            "Duration": "Full-time 1 year (2 semesters)\nPart-time 2 years (4 semesters)",
            "Application Deadline": "28 February 2019 (Full-time - Overseas applicants)\n31 March 2019 (Full-time - Local applicants)",
            "Download Brochure": "https://www.iss.nus.edu.sg/docs/default-source/3.0-graduate-programmes/se-brochure-path.pdf?sfvrsn=4",
            "Info-session": "https://www.iss.nus.edu.sg/graduate-programmes/preview-talks-roadshows",
            "Overall Description": "The NUS Master of Technology in Software Engineering is designed to meet the industry demand for software engineers who can help Singapore organisations to realise the smart nation initiatives through building robust, reliable and scalable software systems. This programme is best suited for individuals who have a few years of experience in software engineering roles and are looking to further enhance their knowledge and skills in architecting scalable, secure and smart software systems.\n\nThe MTech SE programme emphasises the skills required for architecting scalable, secure and smart systems and platforms. The focus will also be exploitation of software technologies, methodologies and management techniques. It focuses on the practical and systematic construction of software systems, using innovative and state-of-the-art techniques..\n\nThe programme will equip you with the essential knowledge and practical experience to architect, design, build and manage the delivery of robust software systems for your organisation and customers.",
            "Learning outcomes": "Become software architects capable of architecting and designing systems that exploit major contemporary software platforms, technologies and methodologies\nBecome software architects capable of architecting and designing smart and secure systems\nBecome data architects equipped with data engineering skills to engineer big data from a variety of sources",
            "Recognition": "Top student is awarded the Accenture Medal and Prize\nTop project team is awarded the Best Project Prize"
        }

    ]
}
