{
    "CertificateList": [
        {
            "CertificateName": "Graduate Certificate in Architecting Scalable Systems",
            "Type": "Architecting Scalable Systems",
            "CourseList": [
                {
                    "name": "NICF- Cloud Native Solution Design (SF)",
                    "duration": "4 days",
                    "code": "CAAR-SF",
                    "category": "Software Systems",
                    "days": "4.0",
                    "price": "3600.00",
                    "course_link": "https://www.iss.nus.edu.sg/executive-education/course/detail/nicf---cloud-native-solution-design-(sf)",
                    "overview": {
                        "full_name": "NICF- Cloud Native Solution Design (SF)",
                        "Reference No": "CRS-Q-0034840-ICT",
                        "Part of": "-",
                        "Duration": "4 days",
                        "Course Time": "9:00am-5:00pm",
                        "Enquiry": "Please contact Ms. Verene HENG at email for more details.",
                        "description": [
                            "Cloud computing is a model for enabling ubiquitous, on-demand shared pool of configurable computing resources (e.g., networks, servers, storage, applications, and services) that can be rapidly provisioned and released with minimal management effort. “Cloud Native Solution Design” course will help the decision makers cut through all the haze and architect the cloud service effectively. The course concentrates on teaching the participants how to design cloud native solution.",
                            "The course will equip the participants with useful pointers to note while designing cloud native solutions. The course also discusses microservices suitability aspects, native design aspects, application migration from traditional hosting, engineering evaluation, service cataloguing, pricing strategy, service level agreements, security, privacy, storage, governance, outage management and service delivery mechanism. This course is part of the Software Systems series and Graduate Certificate in Architecting Scalable Systems series offered by NUS-ISS."
                        ]
                    },
                    "takeaway": [
                        "Evaluate, analyze, translate and document the stakeholder’s identified business requirements into specific solution architecture by working closely with the cloud engineering teams.",
                        "Migrate monolithic systems in an orderly fashion. Analyze each of such solution architecture transition from a traditional setting into cloud hosting migration perspective, and predict necessary change strategies.",
                        "Establish these identified strategies to align with the organization’s business model, security requirements, data privacy, storage needs, metering and monitoring plans, service orchestration, service deployment and service maintenance.",
                        "Select the appropriate services and identify reusable components amongst them.",
                        "Implement microservices to enable organize applications into standalone components that are easier to manage, update, and scale.",
                        "Decide whether microservices and containers are worth the investment, and manage the organizational learning curve associated with them.",
                        "Apply best practices for inter-process communication among microservices.",
                        "Evaluate edge computing strategies and end devices that need inter-cloud communications and container management services."
                    ],
                    "whoattend": [
                        "The target audience would be professionals from the following skills group and job roles:",
                        "Infrastructure Group: Infrastructure Engineer, Cloud Engineer, Senior Cloud Engineer, Senior Infrastructure Engineer, Principal Planning and Design Architect, and Principal Cloud Architect.",
                        "Professional Services Group: IT Consultant, Solutions Integration Architect, Senior IT Consultant, Enterprise Architect, Principal Solutions Architect, Principal IT Consultant, Principal Enterprise Architect, Program Director, and Head of IT Consulting.",
                        "Software and Applications Group: Systems Analyst, Applications Developer, Platform Engineer, Embedded Systems Engineer, Senior Applications Developer, Senior Platform Engineer, Senior Embedded Systems Engineer, Applications Development Manager, Platform Engineering Manager, Embedded Systems Engineering Manager, Applications Architect, Platform Architect, Embedded Systems Architect, and Head of Applications Development."
                    ],
                    "whatcovered": [
                        "M1-Overview of Cloud",
                        "The module discusses about the typical use cases that benefit from cloud service model and its essential characteristics, service models and deployment models available in cloud.",
                        "M2-Cloud Reference Architectures",
                        "This module helps participants understand the business requirements and customer expectations before selecting cloud service models and cloud hosting types. The module also elaborates on the various cloud reference architecture (RA) and typical use cases to help the solution architect choose the most suitable RA for the given business case.",
                        "M3-DevOps Automation",
                        "This module dwells into devops automation. The module discusses how organizations can deliver applications and services at high velocity. The module hints on evolving and improving products at a faster pace for high-class infrastructure management processes.",
                        "M4-Cloud Persistence",
                        "This module discusses various cloud persistence options for cloud native application and how these facilities can be extended even to traditional applications. The module evaluates the business case under discussion and recommends an appropriate choice. This module also hints on the various data storage models and scalability options.",
                        "M5-Architecting Intelligent Systems in the Cloud",
                        "This module also focuses on architecting intelligent systems that combine traditional software engineering principles with new generation intelligent compute libraries such as machine learning, analytics, and other smart algorithms.",
                        "M6-Cloud Adoption and Migration",
                        "A cloud migration is a common approach for getting existing infrastructure and services into a cloud provider. This module discusses in detail the lift-and-shift approach, where certain workloads and tasks are moved from on-premises storage to the cloud.",
                        "M7-Cloud Security",
                        "The module discusses about designing supportive and sensitive data security.",
                        "M8-Cloud Native Architecture",
                        "This module discusses the various aspects involved while architecting applications in the native cloud. The module introduces essential 12-factors for Cloud Native Applications and related design considerations. The module compares and contrasts the use of virtual machine over containers for hosting application in the cloud.",
                        "M9-Microservices Design",
                        "A microservice is an independent, standalone capability designed as an executable or a process that communicates with other microservices through standard but lightweight inter process communication such as Hypertext Transfer Protocol (HTTP), RESTful web services, message queues, and the like. The module discusses design considerations involved while implementing microservices.",
                        "M10: Serverless (Lambda) Architecture",
                        "This module briefly discusses server less architecture - a new style of technical use case in the context of big data, cognitive computing, and IoT systems."
                    ]
                },
                {
                    "name": "NICF- Architecting Software Solutions (SF)",
                    "duration": "5 days",
                    "code": "ARCHSSSF",
                    "category": "Software Systems",
                    "days": "5.0",
                    "price": "4500.00",
                    "course_link": "https://www.iss.nus.edu.sg/executive-education/course/detail/nicf--architecting-software-solutions-(sf)",
                    "overview": {
                        "full_name": "NICF- Architecting Software Solutions (SF)",
                        "Reference No": "CRS-Q-0036481-ICT",
                        "Part of": "-",
                        "Duration": "5 days",
                        "Course Time": "9:00am - 5:00pm",
                        "PDU": "20PDU and PD hours are available for this course",
                        "Enquiry": "Please contact Ms. Jeryn LIN at tel: 66017926 or email for more details.",
                        "description": [
                            "In today’s fast-paced world, organisations are constantly developing and deploying applications to meet business objectives. However, despite efforts to improve engineering practices and technologies, software intensive systems continue to present formidable risks and difficulties in design, construction, deployment and evolution.",
                            "This course is the only one of its kind to focus on solution architecture with emphasis on software qualities such as security, availability, performance and maintainability. Participants will learn about architectural concepts through a combination of lectures and scenario-based workshops for enterprise applications. The course equips the participant with the necessary technical skills to design robust, secure and maintainable architectures. Suitable architectural examples from various application domains like web, mobile and cloud are used to illustrate the concepts.",
                            "Upon successful completion of this course, participants will earn 20 PDUs (PM: 16, Leadership: 3, Business: 1) that can be used to maintain your PMP® credential. Note that for the purpose of PDU reporting by those with PMP® credentials, the PMI REP Provider Number of ISS is “2339”."
                        ]
                    },
                    "takeaway": [
                        "Explain how the application architecture fits into the broader context of business goals and enterprise architecture",
                        "Design the architecture with emphasis on the software quality attributes and their tradeoffs",
                        "Design common application integration components",
                        "Describe the software architecture with views and viewpoints",
                        "Perform threat modelling to identify the threats, vulnerabilities and recommend appropriate controls",
                        "Undertake capacity planning"
                    ],
                    "whoattend": [
                        "System Analysts",
                        "Software Engineers who aspire to be equipped with skills in solution architecting for enterprise applications",
                        "Project Managers and Project Leads who are needs to be involved in architecture solutioning in the project"
                    ],
                    "whatcovered": [
                        "Introduction to Solution Architecture",
                        "Architect the Solution Architecture",
                        "Design Highly Available and Secure Architecture",
                        "Design Performance for Architecture",
                        "Perform Capacity Planning for Architecture",
                        "Ensure Maintainable Architecture"
                    ]
                },
                {
                    "name": "NICF- DevOps Engineering and Automation (SF)",
                    "duration": "3 days",
                    "code": "DOEA",
                    "category": "Software Systems",
                    "days": "4.0",
                    "price": "3600.00",
                    "course_link": "https://www.iss.nus.edu.sg/executive-education/course/detail/devops-engineering-and-automation-SF",
                    "overview": {
                        "full_name": "NICF- DevOps Engineering and Automation (SF)",
                        "Reference No": "CRS-Q-0034841-ICT",
                        "Part of": "-",
                        "Duration": "4 days",
                        "Course Time": "9:00am - 5:00pm",
                        "Enquiry": "Please contact Ms. Jeryn LIN at tel: 66017926 or email for more details.",
                        "description": [
                            "The process to release software to users is often painful, risky and time consuming. Continuous Delivery can help large organisations to become lean, agile and innovative by having reliable and low risks releases, making it possible to adapt continuous updates in line with user feedback, market shifts and changes to business strategies.",
                            "As a result, the entire delivery process is accelerated while improving the quality. Teams from test, support, development and operations function and work together as one delivery team.",
                            "This course aims to provide participants with an in-depth understanding of DevOps Engineering and Automation concepts, best practices and tools and Agile Continuous Delivery methods.",
                            "Participants will learn both the theoretical concepts and practical modules in lectures and hands-on workshops.",
                            "This course is part of the Software Systems Series and Graduate Certificate in Architecting Scalable Systems series offered by NUS-ISS."
                        ]
                    },
                    "takeaway": [
                        "Apply Agile practices for software delivery",
                        "Implement DevOps practices within the Agile method of software delivery",
                        "Implement Software Configuration Management activities using tools",
                        "Implement Software Build Management using leading tools",
                        "Implement Agile Automated Testing using a leading tool",
                        "Perform Automated Testing using the tools in the Agile development environment",
                        "Evaluate the need for continuous integration (CI) and build a CI system",
                        "Perform Continuous Integration methods",
                        "Apply and Implement Continuous Delivery techniques in an Agile environment",
                        "Perform Continuous Delivery using an automated continuous integration approach",
                        "Implement cloud DevOps automation pipeline tools on a leading Cloud platform"
                    ],
                    "whoattend": [
                        "Delivery Managers",
                        "Configuration Managers",
                        "Project Leaders",
                        "Software Developers",
                        "Software Designers",
                        "·others who need to implement DevOps Engineering and Automation methods in their project"
                    ],
                    "whatcovered": [
                        "Agile Development",
                        "Software Configuration Management",
                        "Software Build Management",
                        "Continuous Integration and Continuous Delivery (includes Application Release Automation)",
                        "Agile Automated Testing",
                        "Infrastructure as Code",
                        "Containers and Container Management",
                        "Business metrics and dashboards",
                        "End-to-end DevOps Engineering and Automation"
                    ]
                },
                {
                    "name": "NICF- Platform Engineering (SF)",
                    "duration": "3 days",
                    "code": "PE",
                    "category": "Software Systems",
                    "days": "3.0",
                    "price": "2700.00",
                    "course_link": "https://www.iss.nus.edu.sg/executive-education/course/detail/platform-engineering-SF",
                    "overview": {
                        "full_name": "NICF- Platform Engineering (SF)",
                        "Reference No": "CRS-Q-0034842-ICT",
                        "Part of": "-",
                        "Duration": "3 days",
                        "Course Time": "9:00am - 5:00pm",
                        "Enquiry": "Please contact Ms. Jaime TAN at email for more details.",
                        "description": [
                            "This course is intended for senior software engineers and software architects who aspire to enhance their skills in the area of architecting and engineering software platforms. Through a learning approach with ample hands-on activities, participants will pick up the knowledge and techniques of designing reusable assets and common services, creation of frameworks, API design, platform management and platform data management. Case studies and relevant workshops to re-inforce learnings after important topics are an integral part of this course. This will equip participants with detailed knowledge to build a scalable platform for interconnected or extended applications, thus enabling the creation of network of applications to grow the business ecosystems.",
                            "This course is part of the Software Systems series and Graduate Certificate in Architecting Scalable Systems series offered by NUS-ISS."
                        ]
                    },
                    "takeaway": [
                        "Design and manage robust API access to the platform",
                        "Manage platform usage including access control and performance management",
                        "Manage platform data"
                    ],
                    "whoattend": [
                        "The target course participants are primarily senior software engineers, solution and application architects, who had past experience in software development and design, and seek to enhance their skills in the area of platform engineering.",
                        "It is applicable for professionals engaged in the following areas",
                        "Software design and development",
                        "Software Architecture"
                    ],
                    "whatcovered": [
                        "Overview of Platform Engineering",
                        "Reusable Assets and Frameworks",
                        "API Design",
                        "Microservices and API Gateway",
                        "Platform Management",
                        "Data Management for Platforms"
                    ]
                }
            ],
            "extra1": "Practice Module\n(10 man days)"
        },
        {
            "CertificateName": "Graduate Certificate in Architecting Smart Systems",
            "Type": "Architecting Smart Systems",
            "CourseList": [
                {
                    "name": "NICF- Architecting IoT Solutions (SF)",
                    "duration": "4 days",
                    "code": "AIOTSSF",
                    "category": "Software Systems",
                    "days": "4.0",
                    "price": "3600.00",
                    "course_link": "https://www.iss.nus.edu.sg/executive-education/course/detail/nicf--architecting-iot-solutions-(sf)",
                    "overview": {
                        "full_name": "NICF- Architecting IOT Solutions (SF)",
                        "Reference No": "CRS-Q-0035468-ICT",
                        "Part of": "-",
                        "Duration": "4 days",
                        "Course Time": "9:00am - 5:00pm",
                        "Enquiry": "Please contact Ms. Verene HENG at email for more details.",
                        "description": []
                    },
                    "takeaway": [
                        "Understand the various components that comprises the IoT lifecycle from an architectural perspective: Sense, Ingest, Process, Respond and Analyse",
                        "Be able to define the set of fully managed and integrated services that allow us to easily and securely connect, manage, and ingest IoT data from globally dispersed devices at a large scale, process and analyse/visualize that data in real time, and implement operational changes",
                        "Describe the various hardware and software technologies to support enterprise scale IoT solutions, including: sensors; processors (MCU, SOC, FPGA); pipelines and coupling; boards; networking; protocols; operating systems; software components; power; bandwidth; devices for communication such as gateways",
                        "Define the end-to-end architecture of a large-scale IoT solution, including: layered model; design patterns; cloud services; device integration and communication standards",
                        "Understand RTOS and real-world design constraints: real-time scheduling; synchronisation and communication; multithreaded design; fault-tolerant design",
                        "Be able to address security within their end-to-end IoT solutions",
                        "Determine how analytics and machine learning services can be used to enhance IoT systems.",
                        "Understand Data Management and Access Control and Device Management for IoT solutions"
                    ],
                    "whoattend": [
                        "We do not specifically poses a constraint on entry requirements for this course. However, NUS-ISS also offers a range of other basic courses in software engineering and design for participants new to software. As this course will dive deeper into IoT’s technologies, lifecycle and processes and focus will be on architecting IoT solutions for a variety of different scenarios. It will be particularly useful if participants have attended the related proposed course NICF- Envisioning Smart Urban IoT Solutions SF.",
                        "Prerequisite",
                        "Participants are required to bring their own internet enabled computing device & power charger to access and download e-courseware in PDF e-copies. We will be providing only e-courseware in PDF e-copies and will not issue any more paper copies"
                    ],
                    "whatcovered": [
                        "Overview of IoT architecture",
                        "IoT architecture and the IoT lifecycle",
                        "Utilising cloud IoT services",
                        "Analysing and documenting architectural decisions for enterprise scale IoT solutions",
                        "IoT technologies and communication protocols",
                        "Real-world design constraints and solution options",
                        "Defining the end-to-end IoT solution architecture",
                        "Architecting and documenting the end-to-end IoT solution",
                        "Security considerations for IoT solutions",
                        "Building intelligence into IoT solutions",
                        "IoT Data Management and Access Control",
                        "Architecting and documenting the end-to-end IoT solution",
                        "Device Management for IoT solutions",
                        "Finalising and presenting the IoT solution architecture",
                        "Final Assessment"
                    ]
                },
                {
                    "name": "NICF- Designing Intelligent Edge Computing (SF)",
                    "duration": "4 days",
                    "code": "DIEC",
                    "category": "Software Systems",
                    "days": "4.0",
                    "price": "3600.00",
                    "course_link": "https://www.iss.nus.edu.sg/executive-education/course/detail/designing-intelligent-edge-computing-SF",
                    "overview": {
                        "full_name": "NICF- Designing Intelligent Edge Computing (SF)",
                        "Reference No": "CRS-Q-0035258-ICT",
                        "Part of": "-",
                        "Duration": "4 days",
                        "Course Time": "9:00am - 5:00pm",
                        "Enquiry": "Please contact Ms. Jaime TAN at email for more details.",
                        "description": [
                            "This 4-day programme is intended for anyone who wishes to gain specialised knowledge in designing intelligent Edge Computing systems. This course will benefit those working in medical, manufacturing, defence and other industry types. Participants will gain in-depth knowledge as well as practical skills through projects and assessment that reinforce their learning and engage their newly acquired knowledge.",
                            "This course is part of the Software Systems series and Graduate Certificate in Architecting Smart Systems series offered by NUS-ISS."
                        ]
                    },
                    "takeaway": [
                        "Design Edge compute systems to provide multi-level intelligence for IoT, transducers and other devices.",
                        "Build data collection, analytics, and decision-making capabilities into these Edge compute systems.",
                        "Integrate machine learning and analytics into Edge Computing to perform decision making, self-healing, and self-learning.",
                        "NICF - Statistics Bootcamp (SF)",
                        "NICF - Python for Data, Ops and Things (SF)"
                    ],
                    "whoattend": [
                        "It is applicable for professionals engaged in the following areas.",
                        "Software Architects",
                        "Senior Software Engineers"
                    ],
                    "whatcovered": [
                        "Methodologies and key principles in designing integrated Edge Computing sensor networks",
                        "Capabilities of Edge Computing nodes, sensors, transducers and related technologies",
                        "Fog architecture and cloud-based IoT orchestration patterns/practices for Edge Computing systems"
                    ]
                },
                {
                    "name": "NICF- Humanizing Smart Systems (SF)",
                    "duration": "4 days",
                    "code": "HSS",
                    "category": "Software Systems",
                    "days": "4.0",
                    "price": "3600.00",
                    "course_link": "https://www.iss.nus.edu.sg/executive-education/course/detail/humanizing-smart-systems-SF",
                    "overview": {
                        "full_name": "NICF- Humanizing Smart Systems (SF)",
                        "Reference No": "CRS-Q-0035257-ICT",
                        "Part of": "-",
                        "Duration": "4 days",
                        "Course Time": "9:00am - 5:00pm",
                        "Enquiry": "Please contact Ms. Jaime TAN at email for more details.",
                        "description": [
                            "This 4-day programme is intended for anyone who wishes to gain specialised knowledge in human centric smart systems. This course will benefit those working in medical, manufacturing, defense and other industry types. Participants will gain in-depth knowledge as well as practical skills through projects and assessments that reinforce their learning and engage their newly acquired knowledge.",
                            "Upon completion of the course, participants will be able to:"
                        ]
                    },
                    "takeaway": [
                        "Describe general principles and patterns for holistically building human-centric smart systems",
                        "Design human centric smart interfaces using front end IoT devices such as sensors, smart gloves, and other wearables",
                        "Build a human centric system using the front end IoT devices and open source Motion Analysis Software, like Kinovea and PhysMo, to sense and identify human activities",
                        "Integrate Artificial Intelligence (AI) models and human-centric interfaces such as AR/VR/gesture/voice into the human-centric smart system"
                    ],
                    "whoattend": [
                        "It is applicable for professionals engaged in the following areas:",
                        "Software Architects",
                        "Senior Software Engineers"
                    ],
                    "whatcovered": [
                        "The Humanizing Smart Systems course will be a 4.0 days public short course comprising 4 modules and their respective workshops. Participants will gain important knowledge in designing humanizing smart interfaces and devices using front end IoT devices such as sensors, smart gloves, and other wearables and algorithms. These are not present in our competitors’ courses. There will be practical application of tools, knowledge, and project presentation, thus allowing attendees to develop the knowledge and skills required to develop humanizing smart systems for real world practical applications.",
                        "The outline teaching agenda is as follows:",
                        "Day 1: Human-centric systems design methodologies",
                        "Module 1",
                        "Workshop 1",
                        "Day 2: Human-centric IoT devices",
                        "Module 2",
                        "Workshop 2",
                        "Day 3: Human-Machine Interfacing",
                        "Module 3",
                        "Workshop 3",
                        "Day 4: AI models for Human Activity Recognition",
                        "Module 4",
                        "Workshop 4",
                        "Final Assessment"
                    ]
                }
            ],
            "extra1": "Practice Module\n(10 man days)"
        },
        {
            "CertificateName": "Graduate Certificate in Designing and Managing Products and Platforms",
            "Type": "Designing and Managing Products and Platforms",
            "CourseList": [
                {
                    "name": "NICF- Strategic Product Manager™ (SF)",
                    "duration": "4 days",
                    "code": "SPMRSF",
                    "category": "Digital Products & Platforms",
                    "days": "4.0",
                    "price": "3600.00",
                    "course_link": "https://www.iss.nus.edu.sg/executive-education/course/detail/nicf--strategic-product-manager-(sf)",
                    "overview": {
                        "full_name": "NICF- Strategic Product Manager (SF)",
                        "Reference No": "CRS-Q-0034791-ICT",
                        "Part of": "-",
                        "Duration": "4 days",
                        "Course Time": "9:00am - 5:00pm",
                        "PDU": "12PDU and PD hours are available for this course",
                        "Enquiry": "Please contact Ms. WONG Swee Lee at tel: 65162020 or email for more details.",
                        "description": [
                            "The Strategic Product Manager™ (SPMR) course is a comprehensive 4-day programme presenting participants with a practical and interactive learning experience while providing the necessary knowledge, skills and tools to manage advanced products at technology and high-tech companies.",
                            "The course consists of the following three core modules:",
                            "All participants will receive a free license to the hosted version of the Product Manager's Toolkit® (PMTK) with lifetime free unlimited updates and upgrades to PMTK. They will also receive a free copy of the \"The Product Manager’s Toolkit: Methodologies, Processes and Tasks in High-Tech Product Management\" book.",
                            "Watch this video to find out the definition of product management according to the Blackblot PMTK Methodology™.",
                            "If you want to gauge the level of maturity of product management practice in your organisation, you can use the Blackblot Product Management Maturity Evaluator. Product Management Articles from Blackblot:"
                        ]
                    },
                    "takeaway": [
                        "Effectively plan and market technology products and services using Product Manager’s Toolkit® (PMTK) and PMTK Action Model.",
                        "Demonstrates effective practices that clearly identify and articulate market requirements.",
                        "Contribute to business and market planning activities by exploring key concepts and processes used in formulating plans that evaluate market opportunities and shape the resulting marketing efforts; i.e., business cases and market plans."
                    ],
                    "whoattend": [
                        "Product Manager, Product Marketing Manager, Marketing Executive and Marketing Analyst of all levels, including new appointment holders",
                        "Anyone who intends to move into the discipline of product management",
                        "Anyone who are involved in product planning, product design, product development, and product marketing"
                    ],
                    "whatcovered": [
                        "Corporate strategy mix",
                        "PMTK action model",
                        "Business case",
                        "Product marketing",
                        "Market planning",
                        "Agile development",
                        "Product planning",
                        "Process efficiency",
                        "Product delivery process and more..."
                    ]
                },
                {
                    "name": "NICF- Service Design (SF)",
                    "duration": "3 days",
                    "code": "SID-SF",
                    "category": "Digital Innovation & Design",
                    "days": "3.0",
                    "price": "2400.00",
                    "course_link": "https://www.iss.nus.edu.sg/executive-education/course/detail/nicf--service-design-(sf)",
                    "overview": {
                        "full_name": "NICF- Service Design (SF)",
                        "Reference No": "CRS-Q-0037062-ICT",
                        "Part of": "-",
                        "Duration": "3 days",
                        "Course Time": "9am-5pm",
                        "Enquiry": "Please contact Ms. Elizabeth EE at tel: 65165409 or email for more details.",
                        "description": [
                            "Innovation is a primary source of competitive advantage in the global marketplace. Service Design leans on concepts and practices in ‘Design Thinking’ to research and develop innovative ideas. The course offers organisations the process, methods, tools and techniques to translate innovation into a reality. In order to maximize the benefits of innovation, organisations are currently focused on three key aspects:",
                            "Based on these aspects, this course provides participants with a practical, ‘hands on’ exploration of the principles, tools, and frameworks such as Design Thinking for Service Design. The course also discusses the essentials needed to breed an innovation culture in the organisation.",
                            "This course is part of the Digital Innovation & Design series, Professional Diploma in Smart Health Leadership programme, Software Systems series as well as the Graduate Certificate in Designing and Managing Products and Platforms series offered by NUS-ISS."
                        ]
                    },
                    "takeaway": [
                        "Understand and apply the central concepts of Design Thinking to innovation projects",
                        "Approach service innovation from an outside-in perspective and understand the process for evolving a fuzzy idea into a fully envisioned service concept.",
                        "Understand how to conduct user research and synthesize data from multiple sources in order to discover unmet needs and develop ideas.",
                        "Understand and use tools such as personas, customer journey mapping, service blueprinting and storytelling to realize service innovation",
                        "Illustrate a new service innovation concept and explain its value proposition and the outcome intended for the customer",
                        "Carry out low fidelity prototyping of a proposed innovation concept to evaluate, adapt and refine the idea"
                    ],
                    "whoattend": [
                        "Product Development Managers",
                        "Service Improvement Teams",
                        "Product and Service Managers",
                        "Project Managers",
                        "Innovation Managers",
                        "Quality & Process Improvement Managers",
                        "Marketing Managers & Executives",
                        "Customer Service Managers"
                    ],
                    "whatcovered": [
                        "Innovation Approach using Design Thinking",
                        "User Research and Ethnography",
                        "Identifying Opportunities and Generating Ideas",
                        "Concept Prototyping",
                        "Communicating Concepts",
                        "Implementing Innovation"
                    ]
                },
                {
                    "name": "NICF- Digital Product Strategy (SF)",
                    "duration": "3.7 days",
                    "code": "DPS-SF",
                    "category": "Digital Products & Platforms",
                    "days": "3.7",
                    "price": "3300.00",
                    "course_link": "https://www.iss.nus.edu.sg/executive-education/course/detail/nicf--digital-product-strategy-(sf)",
                    "overview": {
                        "full_name": "NICF- Digital Product Strategy (SF)",
                        "Reference No": "CRS-Q-0037782-ICT",
                        "Part of": "-",
                        "Duration": "3.7 days",
                        "Course Time": "9.00am - 5.00pm",
                        "PDU": "15PDU and PD hours are available for this course",
                        "Enquiry": "Please contact Ms. WONG Swee Lee at tel: 65162020 or email for more details.",
                        "description": []
                    },
                    "takeaway": [
                        "understand the challenges of the digital product eco-system that the product manager operates in",
                        "acquire key skills to develop a strategy for the entire digital product lifecycle - from strategy to development, launch, growth and exit",
                        "demonstrate these understanding and skills acquisition by working in team to develop and present their digital product strategy to a panel of industry product leaders for assessment"
                    ],
                    "whoattend": [
                        "Managers and professional working on corporate planning, strategy and business or product portfolio can also benefit.",
                        "Participants are expected to come from both corporate enterprises and start-ups, and are expected to interact to share views and experiences while working in their respective teams."
                    ],
                    "whatcovered": [
                        "Operating in the new digital products eco-system",
                        "Understanding the landscape and the competition",
                        "Developing an inspiring product vision that guides the team",
                        "Business goals, key performance indicators (KPIs), and the product scorecard",
                        "Aligning to the organisation product portfolio",
                        "Workshop: Develop the Digital Product Vision"
                    ]
                },
                {
                    "name": "Architecting Platforms as a Business",
                    "duration": "4 days"
                }
            ],
            "extra1": "Practice Module\n(10 man days)"
        },
        {
            "CertificateName": "Graduate Certificate in Engineering Big Data",
            "Type": "Engineering Big Data",
            "CourseList": [
                {
                    "name": "Information Architecture for Data-driven Insights",
                    "duration": "4 days"
                },
                {
                    "name": "NICF- Big Data Engineering for Analytics (SF)",
                    "duration": "5 days",
                    "code": "BEAD-SF",
                    "category": "Data Science",
                    "days": "5.0",
                    "price": "4500.00",
                    "course_link": "https://www.iss.nus.edu.sg/executive-education/course/detail/nicf--big-data-engineering-for-analytics-(sf)",
                    "overview": {
                        "full_name": "NICF- Big Data Engineering for Analytics (SF)",
                        "Reference No": "CRS-Q-0035470-ICT",
                        "Part of": "-",
                        "Duration": "5 days",
                        "Course Time": "9:00am - 5:00pm",
                        "Enquiry": "Please contact Ms. Jeryn LIN at tel: 66017926 or email for more details.",
                        "description": []
                    },
                    "takeaway": [
                        "Understand the growth of big data and need for a scalable processing framework. Understand the fundamental characteristics, storage, analysis techniques and the relevant distributions",
                        "Understand the distributed storage essentials, storage needs, and relevant architectural mechanism in processing large amounts of structured, semi-structured and unstructured data.",
                        "Gain expertise with the fault-tolerant computing framework (E.g. YARN) by setting up pseudo cluster nodes or cloud based nodes for processing big data. .",
                        "Construct configurable and executable tasks using the In Memory Processing frameworks (E.g. Spark Core). Understand the nuances of writing functional programs and use the core libraries to manipulate the large corpse of unstructured data residing as Resilient Distributed Datasets.",
                        "Organize, store and manipulate the collected data using processing libraries. For example, using special statistical operation and stream processing data tools (E.g. Spark Special Libraries).",
                        "Understand various data processing, querying and persistence (E.g. Spark QL APIs) available for usage in RDD’s context. Perform tasks such as filtering, selection and categorization."
                    ],
                    "whoattend": [
                        "Business and IT professionals seeking analytical skills to handle large amounts of unstructured data (Data lake e.g. customer feedbacks, product reviews on social media, phone call recordings, etc.) for insights to improve business process and decision-making.",
                        "Individuals who have no knowledge or experience in data engineering for analytics and would like to gain some practical skills in this area so that they may explore work opportunities in data engineering.",
                        "Data analysts and Data Engineers, who want to move from the structured to large amounts of unstructured data engineering."
                    ],
                    "whatcovered": [
                        "The course objective is to explore the engineering aspects of big data storage, querying and processing techniques. The course aims to teach the students to apply the newly acquired proficiencies by developing data intensive applications using distributed compute platform (e.g. using the Hadoop platform, Spark Framework and relevant tools).",
                        "A brief module description is provided below:",
                        "Agenda",
                        "Module 1: Introduction to Data Science, Data Engineering and Big Data",
                        "Module 2: Understand Big Data from an Analytics Perspective",
                        "Module 3: Architectural Viewpoints in Big Data",
                        "Module 4: The Hadoop Ecosystem for Big Data",
                        "Module 5: Distributed File Storage",
                        "Module 6: NoSQL Databases for Big Data",
                        "Module 7: Spark and Functional Programming for Big Data",
                        "Module 8: Spark and Resilient Distributed Data Sets",
                        "Module 9: Spark QL for Big Data",
                        "Module 10: Spark and Real Time Stream Processing",
                        "Module 11: Management of Big Data initiatives",
                        "Discussion and Project Requirement Elaboration",
                        "Project and Assessment",
                        "Project Demonstration, Report Submission and Presentations. Each team will work on a practical case study and submit/present their work done regarding the assigned Big Data project.",
                        "Closing Remarks"
                    ]
                },
                {
                    "name": "Architecting Systems for Real-Time Data Processing",
                    "duration": "3 days"
                }
            ],
            "extra1": "Practice Module\n(10 man days)"
        },
        {
            "CertificateName": "Graduate Certificate in Securing Ubiquitous Systems",
            "Type": "Securing Ubiquitous Systems",
            "CourseList": [
                {
                    "name": "NICF- (ISC)² CISSP CBK Training Seminar (SF)",
                    "duration": "5 days",
                    "code": "CISSP-SF",
                    "category": "CyberSecurity",
                    "days": "5.0",
                    "price": "4050.00",
                    "course_link": "https://www.iss.nus.edu.sg/executive-education/course/detail/nicf--(isc)-cissp-cbk-training-seminar-(sf)",
                    "overview": {
                        "full_name": "NICF- (ISC)² CISSP CBK Training Seminar (SF)",
                        "Reference No": "CRS-Q-0034740-ICT",
                        "Part of": "-",
                        "Duration": "5 days",
                        "Course Time": "9.00am - 5.00pm",
                        "Enquiry": "Please contact Ms. Jane LIM at tel: 66013975 or email for more details.",
                        "description": [
                            "For individuals in the field of information security, the Certified Information Systems Security Professional (CISSP®) credential will render the recognition of their expertise and skills. The globally recognised standard is ideal for experienced information security professionals, including those in mid and senior level managerial positions.",
                            "Positions in many large corporations and government agencies worldwide now require certification, and accredited practitioners have a higher earning potential together with greater career prospects. As a member of the International Information Systems Security Certification Consortium, Inc. or (ISC)2, you will be part of an elite network of certified information security professionals.",
                            "The official (ISC)2 CISSP® CBK® training seminar, the exclusive review course endorsed by (ISC)2, is the most comprehensive and complete review of information systems security concepts and industry best practices. It covers the 8 CISSP® CBK® domains and serves as a good learning tool for mastering concepts and topics related to all aspects of information systems security. This course is part of the Cybersecurity series, Software Systems series, Digital Strategy & Leadership series as well as Graduate Certificate in Securing Ubiquitous Systems series offered by NUS-ISS."
                        ]
                    },
                    "takeaway": [
                        "Master concepts and topics related to all aspects of information systems security in the 8 CISSP® CBK® domains"
                    ],
                    "whoattend": [
                        "IT or Systems Security Managers",
                        "Project Managers",
                        "Systems or Network Engineers",
                        "Systems Analyst or Auditor",
                        "Systems or Network Consultant",
                        "Senior Systems or Database Administrators or Programmers",
                        "Anyone who wishes to refresh and broaden their knowledge in all 8 CISSP® CBK® domains to study for the CISSP® exam"
                    ],
                    "whatcovered": [
                        "Security & risk management",
                        "Asset security",
                        "Security architecture and engineering",
                        "Communication & network security",
                        "Identity & access management",
                        "Security assessment & testing",
                        "Security operations",
                        "Software development security"
                    ]
                },
                {
                    "name": "NICF- Design Secure Mobile Architecture (SF)",
                    "duration": "3 days",
                    "code": "DSMASF",
                    "category": "CyberSecurity",
                    "days": "3.0",
                    "price": "1800.00",
                    "course_link": "https://www.iss.nus.edu.sg/executive-education/course/detail/nicf--design-secure-mobile-architecture-ssdla-sf",
                    "overview": {
                        "full_name": "NICF- Secure Software Development Lifecycle for Agile (SF)",
                        "Reference No": "CRS-Q-0036473-ICT",
                        "Part of": "-",
                        "Duration": "3 days",
                        "Course Time": "9:00am - 5:00pm",
                        "PDU": "10PDU and PD hours are available for this course",
                        "Enquiry": "Please contact Ms. Verene HENG at email for more details.",
                        "description": [
                            "In light of heightened information security concerns, software development lifecycle processes must be approached through implementation of ‘Secure by Design’ practices.",
                            "Without such focus on designing secure software applications, security exposures may lead to serious breaches or costly redevelopment.",
                            "Hence, software developers must be trained to understand security concerns, where they may impact on the solution, and be able to implement the application in a security-aware manner. They must also be able to conduct security risk assessments and incorporate suitable mitigation measures in their software design.",
                            "Software is increasingly being developed within an agile project framework, such as Scrum. Such frameworks encourage iterative and incremental development in multiple iterations or sprints.",
                            "The objective of this course is to instill ‘Secure by Design’ practices into the agile software development process so as to enable the team to produce applications that meet security requirements.",
                            "This course is part of the Cybersecurity series, Software Systems series, Digital Strategy & Leadership series as well as Graduate Certificate in Securing Ubiquitous Systems series offered by NUS-ISS. Upon successful completion of this course, you will earn 10 PDUs (Technical: 8.5, Strategy: 1.5). Note that for the purpose of PDU reporting, the PMI® REP Provider Number of ISS is “2339”."
                        ]
                    },
                    "takeaway": [
                        "Understand the importance of designing secure software applications, risks and mitigations",
                        "Identify key Bodies of Knowledge for secure software development",
                        "Adopt secure development practices within an existing process",
                        "Adopt secure development practices for the end-to-end processes"
                    ],
                    "whoattend": [
                        "System Analysts",
                        "Software Architects",
                        "Software Engineers",
                        "DevOps Engineers",
                        "Project Managers",
                        "Project Leaders"
                    ],
                    "whatcovered": [
                        "Security aspects of software solutions",
                        "Secure software lifecycle frameworks",
                        "Designing secure software applications within an agile SDLC",
                        "Formulating software security requirements",
                        "Threat modelling and software architectural analysis",
                        "Secure design principles",
                        "Secure coding guidelines",
                        "Security quality assurance and testing",
                        "Bridging Security and DevOps"
                    ]
                },
                {
                    "name": "Platform Security",
                    "duration": "3 days"
                },
                {
                    "name": "NICF- Secure Software Development Lifecycle for Agile (SF)",
                    "duration": "3 days",
                    "code": "SSDLASF",
                    "category": "CyberSecurity",
                    "days": "3.0",
                    "price": "2700.00",
                    "course_link": "https://www.iss.nus.edu.sg/executive-education/course/detail/nicf--design-secure-mobile-architecture-ssdla-sf",
                    "overview": {
                        "full_name": "NICF- Secure Software Development Lifecycle for Agile (SF)",
                        "Reference No": "CRS-Q-0036473-ICT",
                        "Part of": "-",
                        "Duration": "3 days",
                        "Course Time": "9:00am - 5:00pm",
                        "PDU": "10PDU and PD hours are available for this course",
                        "Enquiry": "Please contact Ms. Verene HENG at email for more details.",
                        "description": [
                            "In light of heightened information security concerns, software development lifecycle processes must be approached through implementation of ‘Secure by Design’ practices.",
                            "Without such focus on designing secure software applications, security exposures may lead to serious breaches or costly redevelopment.",
                            "Hence, software developers must be trained to understand security concerns, where they may impact on the solution, and be able to implement the application in a security-aware manner. They must also be able to conduct security risk assessments and incorporate suitable mitigation measures in their software design.",
                            "Software is increasingly being developed within an agile project framework, such as Scrum. Such frameworks encourage iterative and incremental development in multiple iterations or sprints.",
                            "The objective of this course is to instill ‘Secure by Design’ practices into the agile software development process so as to enable the team to produce applications that meet security requirements.",
                            "This course is part of the Cybersecurity series, Software Systems series, Digital Strategy & Leadership series as well as Graduate Certificate in Securing Ubiquitous Systems series offered by NUS-ISS. Upon successful completion of this course, you will earn 10 PDUs (Technical: 8.5, Strategy: 1.5). Note that for the purpose of PDU reporting, the PMI® REP Provider Number of ISS is “2339”."
                        ]
                    },
                    "takeaway": [
                        "Understand the importance of designing secure software applications, risks and mitigations",
                        "Identify key Bodies of Knowledge for secure software development",
                        "Adopt secure development practices within an existing process",
                        "Adopt secure development practices for the end-to-end processes"
                    ],
                    "whoattend": [
                        "System Analysts",
                        "Software Architects",
                        "Software Engineers",
                        "DevOps Engineers",
                        "Project Managers",
                        "Project Leaders"
                    ],
                    "whatcovered": [
                        "Security aspects of software solutions",
                        "Secure software lifecycle frameworks",
                        "Designing secure software applications within an agile SDLC",
                        "Formulating software security requirements",
                        "Threat modelling and software architectural analysis",
                        "Secure design principles",
                        "Secure coding guidelines",
                        "Security quality assurance and testing",
                        "Bridging Security and DevOps"
                    ]
                }
            ],
            "extra1": "Practice Module\n(10 man days)"
        }
    ]
}